
Feature('Reg');

var person = (function(){
  var firstnames = ["Алан", "Александр", "Алексей", "Альберт", "Анатолий", "Андрей", "Антон", "Арсен", "Арсений", "Артем", "Артемий", "Артур", "Богдан", "Борис", "Вадим", "Валентин", "Валерий", "Василий", "Виктор", "Виталий", "Владимир", "Владислав", "Всеволод", "Вячеслав", "Геннадий", "Георгий", "Герман", "Глеб", "Гордей", "Григорий", "Давид", "Дамир", "Даниил", "Демид", "Демьян", "Денис", "Дмитрий", "Евгений", "Егор", "Елисей", "Захар", "Иван", "Игнат", "Игорь", "Илья", "Ильяс", "Камиль", "Карим", "Кирилл", "Клим", "Константин", "Лев", "Леонид", "Макар", "Максим", "Марат", "Марк", "Марсель", "Матвей", "Мирон", "Мирослав", "Михаил", "Назар", "Никита", "Николай", "Олег", "Павел", "Петр", "Платон", "Прохор", "Рамиль", "Ратмир", "Ринат", "Роберт", "Родион", "Роман", "Ростислав", "Руслан", "Рустам", "Савва", "Савелий", "Святослав", "Семен", "Сергей", "Станислав", "Степан", "Тамерлан", "Тимофей", "Тимур", "Тихон", "Федор", "Филипп", "Шамиль", "Эдуард", "Эльдар", "Эмиль", "Эрик", "Юрий", "Ян", "Ярослав"],
  lastnames = ["Смирнов", "Иванов", "Кузнецов", "Соколов", "Попов", "Лебедев", "Козлов", "Новиков", "Морозов", "Петров", "Волков", "Соловьёв", "Васильев", "Зайцев", "Павлов", "Семёнов", "Голубев", "Виноградов", "Богданов", "Воробьёв", "Фёдоров", "Михайлов", "Беляев", "Тарасов", "Белов", "Комаров", "Орлов", "Киселёв", "Макаров", "Андреев", "Ковалёв", "Ильин", "Гусев", "Титов", "Кузьмин", "Кудрявцев", "Баранов", "Куликов", "Алексеев", "Степанов", "Яковлев", "Сорокин", "Сергеев", "Романов", "Захаров", "Борисов", "Королёв", "Герасимов", "Пономарёв", "Григорьев", "Лазарев", "Медведев", "Ершов", "Никитин", "Соболев", "Рябов", "Поляков", "Цветков", "Данилов", "Жуков", "Фролов", "Журавлёв", "Николаев", "Крылов", "Максимов", "Сидоров", "Осипов", "Белоусов", "Федотов", "Дорофеев", "Егоров", "Матвеев", "Бобров", "Дмитриев", "Калинин", "Анисимов", "Петухов", "Антонов", "Тимофеев", "Никифоров", "Веселов", "Филиппов", "Марков", "Большаков", "Суханов", "Миронов", "Ширяев", "Александров", "Коновалов", "Шестаков", "Казаков", "Ефимов", "Денисов", "Громов", "Фомин", "Давыдов", "Мельников", "Щербаков", "Блинов", "Колесников"],
  toTranslit = function (text) {
    return text.replace(/([а-яё])|([\s_-])|([^a-z\d])/gi,
    function (all, ch, space, words, i) {
      if (space || words) {
        return space ? '-' : '';
      }
      var code = ch.charCodeAt(0),
      index = code == 1025 || code == 1105 ? 0 :
      code > 1071 ? code - 1071 : code - 1039,
      t = ['yo', 'a', 'b', 'v', 'g', 'd', 'e', 'zh',
      'z', 'i', 'y', 'k', 'l', 'm', 'n', 'o', 'p',
      'r', 's', 't', 'u', 'f', 'h', 'c', 'ch', 'sh',
      'shch', '', 'y', '', 'e', 'yu', 'ya'
      ];
      return t[index];
    });
  }
  
  var firstname = firstnames[Math.floor(Math.random() * 100)],
  lastname = lastnames[Math.floor(Math.random() * 100)];
  
  return {firstname:firstname, lastname:lastname, login:toTranslit(lastname+'_'+firstname+'_job_domru'), ans:lastname}
})();

Before((I) => {

});

var fs = require('fs');


Scenario('test something', (I) => {
  I.amOnPage('https://passport.yandex.ru/registration');
  I.fillField('input[name="firstname"]', person.firstname);
  I.fillField('input[name="lastname"]',person.lastname);
  I.fillField('input[name="login"]',person.login);
  I.fillField('input[name="password"]',person.login+'+1');
  I.fillField('input[name="password_confirm"]',person.login+'+1');
  I.click('У меня нет телефона');
  I.selectOption('._nb-select-fallback','16');
  I.fillField('input[name="hint_answer"]',person.ans);
  I.wait(10)
  fs.appendFileSync('logins.txt', person.login+'\n');
});
